; domain
(define (domain shakey)
  (:requirements :strips)
  (:types hand room ball)
  (:predicates 
    (pos  ?r - room)
    (lit  ?r - room)
    (box  ?r - room)
    (ball_in_hand ?b - ball ?h - hand )
    (ball_pos     ?b - ball ?r - room)
    (empty_hand   ?h - hand)
    (small_door   ?r1 - room ?r2 - room)
    (wide_door    ?r1 - room ?r2 - room))

  (:action move
    :parameters   (?from - room ?to - room)
    :precondition (and (pos ?from) (or 
    		  (wide_door ?from ?to) 
		  (small_door ?from ?to) 
		  (wide_door ?to ?from) 
		  (small_door ?to ?from)))
    :effect       (and (not (pos ?from)) (pos ?to)))

  (:action pick_up
    :parameters   (?h - hand ?b - ball ?r - room)
    :precondition (and (ball_pos ?b ?r) (pos ?r) (lit ?r) (empty_hand ?h))
    :effect       (and (not (empty_hand ?h)) (ball_in_hand ?b ?h) (not (ball_pos ?b ?r))))

  (:action drop
    :parameters   (?h - hand ?b - ball ?r - room)
    :precondition (and (ball_in_hand ?b ?h) (pos ?r))
    :effect       (and (empty_hand ?h) (not (ball_in_hand ?b ?h)) (ball_pos ?b ?r)))

  (:action light_room
    :parameters   (?r - room)
    :precondition (and (not (lit ?r)) (box ?r) (pos ?r))
    :effect       (lit ?r))

  (:action push_box
    :parameters   (?r1 - room ?r2 - room)
    :precondition (and (box ?r1) (pos ?r1) (or (wide_door ?r1 ?r2) (wide_door ?r2 ?r1)))
    :effect       (and (not (box ?r1)) (not (pos ?r1)) (box ?r2) (pos ?r2))))

; problem
(define (problem navigate)
  (:domain shakey)
  (:objects 
    left_hand  - hand 
    right_hand - hand 
    green_ball - ball
    red_ball   - ball
    room11      - room
    room12      - room
    room13      - room
    room21      - room
    room22      - room
    room23      - room
    room31      - room
    room32      - room
    room33      - room)
  (:init
    (box room11)

    (ball_pos green_ball room13)
    (ball_pos red_ball room22)

    (wide_door room11 room12)
    (wide_door room12 room22)
    (wide_door room13 room23)
    (wide_door room21 room22)
    (wide_door room22 room23)

    (small_door room23 room33)
    (small_door room33 room32)
    (small_door room32 room31)

    (lit room31)
    (lit room32)
    (lit room33)

    (pos room31)

    (empty_hand right_hand)
    (empty_hand left_hand))

  (:goal (and (ball_pos green_ball room31) (ball_pos red_ball room11))))

; plan
1. (move room31 room32)
   deleted: (pos room31)
   added: (pos room32)
   goals met: 0 of 2
2. (move room32 room33)
   deleted: (pos room32)
   added: (pos room33)
   goals met: 0 of 2
3. (move room33 room23)
   deleted: (pos room33)
   added: (pos room23)
   goals met: 0 of 2
4. (move room23 room22)
   deleted: (pos room23)
   added: (pos room22)
   goals met: 0 of 2
5. (move room22 room12)
   deleted: (pos room22)
   added: (pos room12)
   goals met: 0 of 2
6. (move room12 room11)
   deleted: (pos room12)
   added: (pos room11)
   goals met: 0 of 2
7. (push_box room11 room12)
   deleted: (box room11) (pos room11)
   added: (box room12) (pos room12)
   goals met: 0 of 2
8. (push_box room12 room22)
   deleted: (box room12) (pos room12)
   added: (box room22) (pos room22)
   goals met: 0 of 2
9. (light_room room22)
   added: (lit room22)
   goals met: 0 of 2
10. (pick_up left_hand red_ball room22)
   deleted: (empty_hand left_hand) (ball_pos red_ball room22)
   added: (ball_in_hand red_ball left_hand)
   goals met: 0 of 2
11. (push_box room22 room12)
   deleted: (box room22) (pos room22)
   added: (box room12) (pos room12)
   goals met: 0 of 2
12. (push_box room12 room11)
   deleted: (box room12) (pos room12)
   added: (box room11) (pos room11)
   goals met: 0 of 2
13. (drop left_hand red_ball room11)
   deleted: (ball_in_hand red_ball left_hand)
   added: (empty_hand left_hand) (ball_pos red_ball room11)
   goals met: 1 of 2
14. (push_box room11 room12)
   deleted: (box room11) (pos room11)
   added: (box room12) (pos room12)
   goals met: 1 of 2
15. (push_box room12 room22)
   deleted: (box room12) (pos room12)
   added: (box room22) (pos room22)
   goals met: 1 of 2
16. (push_box room22 room23)
   deleted: (box room22) (pos room22)
   added: (box room23) (pos room23)
   goals met: 1 of 2
17. (push_box room23 room13)
   deleted: (box room23) (pos room23)
   added: (box room13) (pos room13)
   goals met: 1 of 2
18. (light_room room13)
   added: (lit room13)
   goals met: 1 of 2
19. (pick_up left_hand green_ball room13)
   deleted: (empty_hand left_hand) (ball_pos green_ball room13)
   added: (ball_in_hand green_ball left_hand)
   goals met: 1 of 2
20. (push_box room13 room23)
   deleted: (box room13) (pos room13)
   added: (box room23) (pos room23)
   goals met: 1 of 2
21. (move room23 room33)
   deleted: (pos room23)
   added: (pos room33)
   goals met: 1 of 2
22. (move room33 room32)
   deleted: (pos room33)
   added: (pos room32)
   goals met: 1 of 2
23. (move room32 room31)
   deleted: (pos room32)
   added: (pos room31)
   goals met: 1 of 2
24. (drop left_hand green_ball room31)
   deleted: (ball_in_hand green_ball left_hand)
   added: (empty_hand left_hand) (ball_pos green_ball room31)
   goals met: 2 of 2
